C4.org
#+TITLE: C4 Configuration
#+DATE: 2021-01-23
#+AUTHOR: Chatman R. Jr
:PROPERTIES:
:header-args: :mkdirp yes
:header-args:emacs-lisp: :tangle "./C4.el" :session "C4"
:END:

* Summary

This configuration is my personal configuration/sandbox that grows as I use my favorite productivity
environment and learn how to do more with it.

C4 prioritizes ease, convenience and performance. The aesthethic and workflow are rather spartan,
building from a base of Emacs itself instead of forcing it to be something else.

This is an Org-driven configuration consisting of this file (=C4.org=), the generated =C4.el= and
the =init.el= that loads it on startup.

If something doesn't add value to my workflow, it simply isn't here.

Custom variables and procedures in this config are always prefixed with =C4=.

* Initialization
** Package Management

C4 requires [[https://github.com/raxod502/straight.el][straight.el]] and [[https://github.com/jwiegley/use-package][use-package]], so that gets loaded in first.

#+BEGIN_SRC emacs-lisp
  ;;; Setup straight.el with use-package
  (setq straight-repository-branch "develop")
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; use-package integration
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)

#+END_SRC

** Building the Configuration

After package setup, we need to load in [[https://orgmode.org][Org Mode]] to build the configuration as well as attach a hook
to rebuild it on save.

#+BEGIN_SRC emacs-lisp

  ;;; Need Org Mode to be first package installed because it builds the config.
  (use-package org
    :straight org-plus-contrib)

  ;; Generate C4.el from the source blocks in C4.org
  (defun C4/init ()
    (org-babel-tangle-file
     (concat user-emacs-directory "C4.org")
     (concat user-emacs-directory "C4.el")))

  ;; Always generate on load
  (C4/init)

  ;; Setup a hook to re-tangle the config on modification.
  (add-hook 'org-mode-hook
            (lambda () (add-hook 'after-save-hook #'C4/init)))

#+END_SRC

C4 is a module-based configuration, so now we load those.

#+BEGIN_SRC emacs-lisp

  (require 'cl-lib)

  (require 'base
           (concat user-emacs-directory "modules/base.el"))
  (require 'projects
           (concat user-emacs-directory "modules/projects.el"))
  (require 'code
           (concat user-emacs-directory "modules/code.el"))
  (require 'documents
           (concat user-emacs-directory "modules/documents.el"))
  (require 'desktop
           (concat user-emacs-directory "modules/desktop.el"))

#+END_SRC

** Startup Performance
*** Garbage collection

The first optimization involves increasing the Emacs garbage collection threshold to =100MB= on
startup. This gives a slight boost in initialization. After Emacs starts up, we use a hook to reduce
the threshold back to its approximate initial state.

#+BEGIN_SRC emacs-lisp

  ;; Raise the garbage collection threshold high as emacs starts
  (setq gc-cons-threshold 100000000)
  (setq read-process-output-max (* 1024 1024))

  ;; Drop it down once loaded
  (add-hook 'after-init-hook #'(lambda () (setq gc-cons-threshold 1000000)))

#+END_SRC

** Housekeeping

Now I want to do some decluttering. Emacs has a way of operating with files that can leave a lot of
crap behind in my filesystem, so I needed to do a little cleanup and ordering of where and if it
generates temporary files and directories.

*** Inhibit lockfiles and custom files

My experience with lockfiles is that they add a lot of noise to my directories and projects, so I'm
just going to disable them entirely. The same goes for custom files, because I prefer to do all of
my customizations with Emacs Lisp.

#+BEGIN_SRC emacs-lisp

  ;; Lockfiles do more harm than good
  (setq create-lockfiles nil)

  ;; Custom files just add clutter
  (setq custom-file null-device)

#+END_SRC

*** no-littering

no-littering is a great package that ensures files and directories generated by Emacs or its
packages are allocated to their proper places. The killer feature is how it allows you to set a
central directory for all autosaved files.

#+BEGIN_SRC emacs-lisp

  ;; Put temporary and data files in proper locations
  (use-package no-littering
    :custom
    (auto-save-file-name-transforms
     `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))

#+END_SRC

*** Create parent directories automatically

One great thing about Emacs is that I can manage my ideas and work as they come. I streamline this
by telling Emacs to automatically create directories that don't exist for new files. This allows me
to build the file structure for my projects on the fly.

#+BEGIN_SRC emacs-lisp

  ;; Create parent dirs when opening new files
  (add-to-list 'find-file-not-found-functions #'C4/create-parent)

  (defun C4/create-parent ()
    "Ensures that the parent dirs are created for a nonexistent file."
    (let ((parent-directory (file-name-directory buffer-file-name)))
      (when (and (not (file-exists-p parent-directory))
                 (y-or-n-p (format
                            "Directory `%s' does not exist! Create it?"
                            parent-directory)))
        (make-directory parent-directory t))))

#+END_SRC

*** whitespace-cleanup-mode

whitespace-cleanup-mode is a package that intelligently checks files for errant whitespace and
cleans it up before saving. By default, C4 enables this behavior globally.

Some modes can be set to disable this behavior as exceptions.

#+BEGIN_SRC emacs-lisp

  ;;; Clean up whitespace in all major modes on save
  (use-package whitespace-cleanup-mode
    :config
    (global-whitespace-cleanup-mode t))

#+END_SRC

** Debugging the Configuration

When things break, I need ways of figuring out the problem. And without measurements, I can't make improvements.

*** esup

ESUP (Emacs Start Up Profiler) is an invaluable package for benchmarking how quickly Emacs loads. My
aim: make C4 feature complete for my needs while also loading fast enough for my slightly older laptop.

#+BEGIN_SRC emacs-lisp

  ;;; Benchmark Emacs startup to debug performance
  (use-package esup)

#+END_SRC

*** elisp-bug-hunter

elisp-bug-hunter is a package that allows me to track down and eliminate bugs in C4 that might be
hiding in the tall grass.

#+BEGIN_SRC emacs-lisp

  ;;; Debug init file errors
  (use-package bug-hunter)

#+END_SRC

*** explain-pause-mode

explain-pause-mode is like =top= (more accurately =htop=) for Emacs. It allows you see all recently
run operations and discover which ones are making Emacs lag. This ensures tight performance carries
over for more than just startup times.

#+BEGIN_SRC emacs-lisp

  ;;; Check running processes in Emacs for slowdowns
  (use-package explain-pause-mode
    :config
    (explain-pause-mode))

#+END_SRC

* Utilities

This configuration includes the crux package. It's way too useful not to use. Especially since I
opted out of Vim emulation.

#+BEGIN_SRC emacs-lisp

  (use-package crux
    :hook
    (find-file . crux-reopen-as-root-mode))

#+END_SRC

* Keybindings

This configuration sets up keybindings immediately after initialization, because it uses a non-evil
modal setup that responds to modes in context.

It does this by using:

+ modalka to enable a global command mode
+ hydra for definining transient mode states for complex operations
+ general.el unites the keybindings interface under global and mnemonic bindings
+ which-key allows keybinding discoverability

** Rationale

Emacs is slowly pushing me to think less like a Vimmer, and because of this, evil-mode feels limiting.

I'm beginning to understand that major and minor modes *are already contextual* and it makes the
most sense to define keybindings in Emacs according to which modes are /active/ in a buffer rather
than by toggling arbitrary states.

** Making bindings discoverable

#+BEGIN_SRC emacs-lisp

  ;;; Setup which-key for keybinding discoverability
  (use-package which-key
    :custom
    (which-key-idle-delay 0.96)
    :config
    (which-key-mode))

#+END_SRC

** Command Mode

Command Mode is a global modal state for quickly issuing commands to Emacs via a set of mnemonic conventions.

#+BEGIN_QUOTE
If you're not using EXWM, make sure you remove that last hook.
#+END_QUOTE

*** Initialization

#+BEGIN_SRC emacs-lisp

  ;;; Command mode initialization
  (use-package modalka
    :commands modalka-mode
    :hook
    (text-mode . modalka-mode)
    (prog-mode . modalka-mode)
    (exwm-mode . modalka-mode))

#+END_SRC

*** Setup

#+BEGIN_SRC emacs-lisp

  ;;; Command mode setup
  (use-package general
    :config
    ;; Unbind C-SPC and rebind it to toggle Command Mode
    (global-unset-key (kbd "C-SPC"))
    (general-def "C-SPC" 'modalka-mode)

    ;; Create a global definitiion key for non-prefixed Command Mode actions
    (general-create-definer C4/global-key-def
      :keymaps 'modalka-mode-map)

    ;; Create a mnemonic leader key under Command Mode
    (general-create-definer C4/leader-key-def
      :keymaps 'modalka-mode-map
      :prefix "SPC"
      :global-prefix [\s-SPC])

    ;; Command mode universals
    (C4/global-key-def
      "." '(repeat :wk "repeat last command")
      ">" '(consult-complex-command :wk "repeat command history")
      "RET" '(modalka-mode :wk "insert text"))

    ;; Command mode navigation
    (C4/global-key-def
      "w" '(scroll-down-command :wk "scroll up the buffer")
      "W" '(beginning-of-buffer :wk "jump point to beginning of buffer")
      "s" '(scroll-up-command :wk "scroll down the buffer")
      "S" '(end-of-buffer :wk "jump point to end of buffer")
      "a" '(beginning-of-line-text :wk "jump point to beginning of line")
      "A" '(beginning-of-line :wk "jump point to beginning of line [absolute]")
      "d" '(end-of-line :wk "jump point to end of line")
      "i" '(previous-logical-line :wk "previous line")
      "k" '(next-logical-line :wk "next line")
      "j" '(backward-char :wk "previous char")
      "l" '(forward-char :wk "next char")
      "h" '(backward-word :wk "jump point to previous word")
      ";" '(forward-word :wk "jump point to next word")))

  ;;; Setup transient mode-ish states
  (use-package hydra)

#+END_SRC

