C4.el
;;; Setup straight.el with use-package
(setq straight-repository-branch "develop")
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; use-package integration
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

;;; Need Org Mode to be first package installed because it builds the config.
(use-package org
  :straight org-plus-contrib)

;; Generate C4.el from the source blocks in C4.org
(defun C4/init ()
  (org-babel-tangle-file
   (concat user-emacs-directory "C4.org")
   (concat user-emacs-directory "C4.el")))

;; Always generate on load
(C4/init)

;; Setup a hook to re-tangle the config on modification.
(add-hook 'org-mode-hook
          (lambda () (add-hook 'after-save-hook #'C4/init)))

(require 'cl-lib)

(require 'base
         (concat user-emacs-directory "modules/base.el"))
(require 'projects
         (concat user-emacs-directory "modules/projects.el"))
(require 'code
         (concat user-emacs-directory "modules/code.el"))
(require 'documents
         (concat user-emacs-directory "modules/documents.el"))
(require 'desktop
         (concat user-emacs-directory "modules/desktop.el"))

;; Raise the garbage collection threshold high as emacs starts
(setq gc-cons-threshold 100000000)
(setq read-process-output-max (* 1024 1024))

;; Drop it down once loaded
(add-hook 'after-init-hook #'(lambda () (setq gc-cons-threshold 1000000)))

;; Lockfiles do more harm than good
(setq create-lockfiles nil)

;; Custom files just add clutter
(setq custom-file null-device)

;; Put temporary and data files in proper locations
(use-package no-littering
  :custom
  (auto-save-file-name-transforms
   `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))

;; Create parent dirs when opening new files
(add-to-list 'find-file-not-found-functions #'C4/create-parent)

(defun C4/create-parent ()
  "Ensures that the parent dirs are created for a nonexistent file."
  (let ((parent-directory (file-name-directory buffer-file-name)))
    (when (and (not (file-exists-p parent-directory))
               (y-or-n-p (format
                          "Directory `%s' does not exist! Create it?"
                          parent-directory)))
      (make-directory parent-directory t))))

;;; Clean up whitespace in all major modes on save
(use-package whitespace-cleanup-mode
  :config
  (global-whitespace-cleanup-mode t))

;;; Benchmark Emacs startup to debug performance
(use-package esup)

;;; Debug init file errors
(use-package bug-hunter)

;;; Check running processes in Emacs for slowdowns
(use-package explain-pause-mode
  :config
  (explain-pause-mode))

(use-package crux
  :hook
  (find-file . crux-reopen-as-root-mode))

;;; Setup which-key for keybinding discoverability
(use-package which-key
  :custom
  (which-key-idle-delay 0.96)
  :config
  (which-key-mode))

;;; Command mode initialization
(use-package modalka
  :commands modalka-mode
  :hook
  (text-mode . modalka-mode)
  (prog-mode . modalka-mode)
  (exwm-mode . modalka-mode))

;;; Command mode setup
(use-package general
  :config
  ;; Unbind C-SPC and rebind it to toggle Command Mode
  (global-unset-key (kbd "C-SPC"))
  (general-def "C-SPC" 'modalka-mode)

  ;; Create a global definitiion key for non-prefixed Command Mode actions
  (general-create-definer C4/global-key-def
    :keymaps 'modalka-mode-map)

  ;; Create a mnemonic leader key under Command Mode
  (general-create-definer C4/leader-key-def
    :keymaps 'modalka-mode-map
    :prefix "SPC"
    :global-prefix [\s-SPC])

  ;; Command mode universals
  (C4/global-key-def
    "." '(repeat :wk "repeat last command")
    ">" '(consult-complex-command :wk "repeat command history")
    "RET" '(modalka-mode :wk "insert text"))

  ;; Command mode navigation
  (C4/global-key-def
    "w" '(scroll-down-command :wk "scroll up the buffer")
    "W" '(beginning-of-buffer :wk "jump point to beginning of buffer")
    "s" '(scroll-up-command :wk "scroll down the buffer")
    "S" '(end-of-buffer :wk "jump point to end of buffer")
    "a" '(beginning-of-line-text :wk "jump point to beginning of line")
    "A" '(beginning-of-line :wk "jump point to beginning of line [absolute]")
    "d" '(end-of-line :wk "jump point to end of line")
    "i" '(previous-logical-line :wk "previous line")
    "k" '(next-logical-line :wk "next line")
    "j" '(backward-char :wk "previous char")
    "l" '(forward-char :wk "next char")
    "h" '(backward-word :wk "jump point to previous word")
    ";" '(forward-word :wk "jump point to next word")))

;;; Setup transient mode-ish states
(use-package hydra)

(C4/leader-key-def
