C4.el
  "'" '(vterm :wk "open terminal from current dir")
  "SPC" '(universal-argument :wk "command modifier"))

(C4/leader-key-def
  "b" '(:ignore t :wk "buffer")
  "bb" '(consult-buffer :wk "switch")
  "bB" '(consult-buffer-other-window :wk "switch other window")
  "bd" '(kill-current-buffer :wk "kill")
  "bD" '(kill-some-buffers :wk "kill multiple")
  "bn" '(:ignore t :wk "narrow")
  "bnn" '(widen :wk "reset")
  "bnd" '(narrow-to-defun :wk "to defun")
  "bnp" '(narrow-to-page :wk "to page")
  "bnr" '(narrow-to-region :wk "to region")
  "bk" '(kill-current-buffer :wk "kill")
  "bK" '(kill-some-buffers :wk "kill multiple")
  "bs" '(:ignore t :wk "search")
  "bss" '(ctrlf-forward-literal :wk "forward literal")
  "bsS" '(ctrlf-backward-literal :wk "backward literal")
  "bsf" '(ctrlf-forward-fuzzy :wk "forward fuzzy")
  "bsF" '(ctrlf-backward-fuzzy :wk "backward fuzzy")
  "bsr" '(ctrlf-forward-regexp :wk "forward regexp")
  "bsR" '(ctrlf-backward-regexp :wk "backward regexp")
  "bw" '(save-buffer :wk "write")
  "bW" '(save-some-buffers :wk "write modified"))

(C4/leader-key-def
 "c" '(:ignore t :wk "C4 config")
 "cc" '(C4/open-config :wk "open")
 "cd" '(:ignore t :wk "debug")
 "cdd" '(C4/esup-init :wk "startup")
 "cde" '(C4/bug-hunter-init :wk "errors")
 "cdp" '(explain-pause-top :wk "processes")
 "cr" '(C4/reload-config :wk "reload")
 "ce" '(:ignore t :wk "eval")
 "cee" '(eval-last-sexp :wk "S-exp")
 "ceb" '(eval-buffer :wk "buffer")
 "ced" '(eval-defun :wk "defun")
 "cer" '(eval-region :wk "region"))

(defun C4/generated-conf ()
  (concat user-emacs-directory "C4.el"))

(defun C4/esup-init ()
  "Profiles the correct init file"
  (interactive)
  (esup (C4/generated-conf)))

(defun C4/bug-hunter-init ()
  "Debugs the correct init file"
  (interactive)
  (bug-hunter-file (C4/generated-conf)))

(defun C4/open-config ()
  "Open files in config directory."
  (interactive)
  (find-file (concat user-emacs-directory "C4.org")))

(defun C4/reload-config ()
  "Reloads the config in place."
  (interactive)
  (load-file (C4/generated-conf)))

(C4/leader-key-def
  "f" '(:ignore t :wk "file")
  "ff" '(find-file :wk "find")
  "fr" '(crux-rename-file-and-buffer :wk "rename"))

(C4/leader-key-def
 "h" '(:ignore t :wk "help")
 "ha" '(consult-apropos :wk "apropos")
 "hf" '(describe-function :wk "function")
 "hF" '(describe-face :wk "face")
 "hc" '(helpful-command :wk "command")
 "hv" '(describe-variable :wk "variable")
 "hk" '(helpful-key :wk "keybinding")
 "hs" '(helpful-at-point :wk "symbol at point")
 "hm" '(info-emacs-manual :wk "Emacs"))

(C4/leader-key-def
  "o" '(:ignore t :wk "org")
  "oa" '(:ignore t :wk "agenda")
  "oaa" '(org-agenda-list :wk "weekly")
  "oaf" '(org-agenda :wk "full")
  "oat" '(org-set-tags-command :wk "tags")
  "ob" '(:ignore t :wk "buffer")
  "obb" '(org-insert-link :wk "link")
  "obc" '(org-capture :wk "capture")
  "obn" '(:ignore t :wk "narrow")
  "obnn" '(org-toggle-narrow-to-subtree :wk "subtree")
  "obnb" '(org-narrow-to-block :wk "block")
  "obne" '(org-narrow-to-element :wk "element")
  "obr" '(org-refile :wk "refile")
  "obs" '(C4/org-trek/body t :wk "search")
  "od" '(:ignore t :wk "date")
  "odd" '(org-deadline :wk "deadline")
  "ods" '(org-schedule :wk "schedule")
  "os" '(:ignore t :wk "special")
  "oss" '(org-edit-special :wk "edit")
  "osx" '(org-edit-src-exit :wk "exit with edits")
  "osX" '(org-edit-src-abort :wk "exit without edits")
  "ose" '(org-babel-execute-src-block :wk "execute")
  "ost" '(org-babel-tangle :wk "tangle"))

(defhydra C4/org-trek (:timeout 10)
  "A transient mode to logically traverse an Org file."
  ("s" org-babel-next-src-block "next source block")
  ("S" org-babel-previous-src-block "previous source block")
  ("h" org-forward-heading-same-level "next heading at current level")
  ("H" org-backward-heading-same-level "previous heading at current level")
  ("v" org-next-visible-heading "next visible heading")
  ("V" org-previous-visible-heading "previous visible heading")
  ("RET" nil "exit" :exit t))

(C4/leader-key-def
 "p" '(:ignore t :wk "project")
 "p'" '(projectile-run-vterm :wk "open terminal")
 "pp" '(projectile-switch-project :wk "switch")
 "pf" '(projectile-find-file :wk "find file")
 "pg" '(:ignore t :wk "git")
 "pgg" '(magit-status :wk "status")
 "pgc" '(magit-commit :wk "commit")
 "pgd" '(magit-diff :wk "diff")
 "pgf" '(:ignore t :wk "forge")
 "pgff" '(forge-pull :wk "pull")
 "pgfF" '(forge-fork :wk "fork repo")
 "pgfi" '(forge-list-issues :wk "issues")
 "pgfI" '(forge-create-issue :wk "create issue")
 "pgi" '(magit-init :wk "init")
 "pgp" '(magit-push :wk "push")
 "pgP" '(magit-pull :wk "pull")
 "pgr" '(magit-remote :wk "remote")
 "pgs" '(magit-stage :wk "stage")
 "pgS" '(magit-stage-file :wk "stage file")
 "ps" '(consult-ripgrep :wk "search"))

(C4/leader-key-def
  "q" '(:ignore t :wk "quit")
  "qq" '(save-buffers-kill-emacs :wk "and save")
  "qQ" '(kill-emacs :wk "really quit"))

(C4/leader-key-def
  "t" '(:ignore t :wk "toggle")
  "tt" '(C4/theme-switcher/body :wk "theme"))

(defhydra C4/theme-switcher ()
  "Select a variant from main C4 themes"
  ("l" C4/light "light variant")
  ("d" C4/dark "dark variant")
  ("b" C4/black "black variant")
  ("RET" nil "exit" :exit t))

(defun C4/light ()
  "Clap on!"
  (interactive)
  (consult-theme 'minimal-light))

(defun C4/dark ()
  "Dimmer switch!"
  (interactive)
  (consult-theme 'minimal))

(defun C4/black ()
  "Clap off!"
  (interactive)
  (consult-theme 'minimal-black))

(C4/leader-key-def
