C4.org
**** Window (=w=)

This domain wraps all commands that affect windows.

Windows in Emacs can be split, moved, and closed when not needed.

This marks one of the biggest differences between Vim and Emacs: windows are /views/. Buffers in
Emacs are detached from windows and are not killed when a window closes. They persist in the
background until called into another window.

Their state is preserved.

#+BEGIN_QUOTE
C4 is built to center Emacs as the driver of my entire desktop computing experience. At this point,
Emacs largely /is/ my workstation.

So this domain includes bindings for manipulating X windows served by EXWM.

If you use this configuration and find you don't want or need Emacs to be your window manager, you
can remove the desktop bindings and the environment configuration.

Everything will still work in standalone Emacs instances. If it doesn't, please submit an issue.
#+END_QUOTE

#+BEGIN_SRC emacs-lisp

  (C4/leader-key-def
   "w" '(:ignore t :wk "window")
   "ww" '(other-window :wk "cycle windows")
   "wc" '(delete-window :wk "close")
   "wC" '(delete-other-windows :wk "fill frame")
   "wd" '(:ignore t :wk "desktop")
   "wdf" '(exwm-floating-toggle-floating :wk "floating")
   "wdF" '(exwm-layout-toggle-fullscreen :wk "fullscreen")
   "wdk" '(exwm-layout-toggle-keyboard :wk "keyboard mode")
   "wdm" '(exwm-layout-toggle-mode-line :wk "mode line")
   "wdM" '(exwm-layout-toggle-minibuffer :wk "minibuffer")
   "wn" '(:ignore t :wk "navigator")
   "wnn" '(C4/window-commander/body :wk "interactive")
   "wni" '(windmove-up :wk "jump up")
   "wnI" '(windmove-swap-states-up "swap up")
   "wnk" '(windmove-down :wk "jump down")
   "wnK" '(windmove-swap-states-down :wk "swap down")
   "wnj" '(windmove-left :wk "jump left")
   "wnJ" '(windmove-swap-states-left :wk "swap left")
   "wnl" '(windmove-right :wk "jump right")
   "wnL" '(windmove-swap-states-right :wk "swap right")
   "wnw" '(windmove-display-up :wk "open next window above")
   "wnW" '(windmove-delete-up :wk "close window above")
   "wns" '(windmove-display-down :wk "open next window below")
   "wnS" '(windmove-delete-down :wk "close window below")
   "wna" '(windmove-display-left :wk "open next window left")
   "wnA" '(windmove-delete-left :wk "close window to left")
   "wnd" '(windmove-display-right :wk "open next window right")
   "wnD" '(windmove-delete-right :wk "close window to right")
   "ws" '(:ignore t :wk "split")
   "wss" '(split-window-below :wk "horizontal")
   "wsS" '(split-window-right :wk "vertical"))

  (defhydra C4/window-commander (:timeout 10)
    "Interactive window navigation"
    ("SPC" other-window "cycle")
    ("c" delete-window "close")
    ("C" delete-other-windows "fill frame")
    ("i" windmove-up "jump up")
    ("I" windmove-swap-states-up "swap up")
    ("k" windmove-down "jump down")
    ("K" windmove-swap-states-down "swap down")
    ("j" windmove-left "jump left")
    ("J" windmove-swap-states-left "swap left")
    ("l" windmove-right "jump right")
    ("L" windmove-swap-states-right "swap right")
    ("w" windmove-display-up "open next above")
    ("W" windmove-delete-up "close above")
    ("s" windmove-display-down "open next below")
    ("S" windmove-delete-down "close below")
    ("a" windmove-display-left "open next to left")
    ("A" windmove-delete-left "close left")
    ("d" windmove-display-right "open next to right")
    ("D" windmove-delete-right "close right")
    ("RET" nil "exit" :exit t))

#+END_SRC

* Defaults
* Projects
* Programming Modes
* Document Modes
* Desktop Environment
* Modules
** Base

The =base.el= module sets the /baseline/ experience that C4 is intended to provide without any of its other enhancements. This includes:

+ setting the user
+ setting the theme and modeline
+ setting the typography (code and document)
+ sensible UI enhancements
+ essential UX enhancements

The following block configures the settings for the base module.

#+BEGIN_SRC emacs-lisp

  (c4/user
    :name "Chatman R. Jr"
    :email "crjr.code@protonmail.com")

  (c4/base
    :theme 'minimal-light
    :typography
    (c4/typography
      :code '("Input" 13)
      :document '("Lora" 16)))

#+END_SRC

You can take a closer look at the module's inclusions below.

*** ~c4/user~

This function sets the user identity.

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"
(cl-defun c4/user (&key name email)
  "Define user identity."
  (setq user-full-name name
          user-full-email email))

#+END_SRC


*** ~c4/base~

This module is exposed to our =C4.el= to create our settings for the base look and feel and
also some essential functionality. It's composed of the =ui= and =ux= modules that follow below.

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"
(cl-defun c4/base (&key theme typography)
  (eval (c4/ui theme typography))
  (c4/ux))
#+END_SRC

Let's have a closer look at those subroutines.

**** ~c4/ui~

Now, we set the base UI. It accepts a theme and typography settings from the submodules
documented below.  It also sets basic options that go a long way toward making the
Emacs UI look halfway decent.

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

(defun c4/ui (theme typography)
  "A module for the base UI."
  (setq-default cursor-type 'bar) ; default cursor as bar
  (setq-default frame-title-format '("%b")) ; window title is the buffer name

  (setq linum-format "%4d ") ; line number format
  (column-number-mode 1)
  (show-paren-mode 1) ; show closing parens by default

  (menu-bar-mode -1) ; disable the menubar
  (scroll-bar-mode -1) ; disable visible scroll bar
  (tool-bar-mode -1) ; disable toolbar
  (tooltip-mode -1) ; disable tooltips
  (set-fringe-mode 8) ; allow some space

  ;; Show line numbers in programming modes
  (add-hook 'prog-mode-hook
            (if (and (fboundp 'display-line-numbers-mode) (display-graphic-p))
                #'display-line-numbers-mode
              #'linum-mode))


  ;; Disable for document and terminal modes
  (dolist (mode '(
      org-mode-hook
      term-mode-hook
      shell-mode-hook
      treemacs-mode-hook
      vterm-mode
      eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  ;; Make some icons available
  (use-package all-the-icons)

  (eval (c4/theme theme))
  (eval typography))

#+END_SRC

This is a good time to mention that C4 also contains internal modules for composing
functionality across its main modules. These submodules can be swapped in and out as
needed without issue.

The UI base uses =c4/theme= and =c4/typography= submodules. Which I'll explain now.

***** ~c4/theme~

The theme submodule sets up the mode line with [[https://github.com/Malabarba/smart-mode-line][the smart-mode-line package]]. I know a lot of
configurations swear by the Doom Emacs mode line, but I wanted something lighter.

I only want rich-minority to show minor modes I directly allow, so I set the blacklist to =nil=,
and initialize the whitelist with an empty string.

It also checks and installs a subset of themes based on the prefix of the themes passed in.

C4 prefers the [[https://github.com/anler/minimal-theme][minimal theme]] collection, but you can easily any others you want.

The last thing it does is disable the fringe background for that extra bit of crispness.

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

  (defun c4/theme (theme)
    "A submodule for setting a theme and configuring the modeline."
    (use-package smart-mode-line
      :custom
      (sml/theme 'respectful)
      (sml/no-confirm-load-theme t)
      (sml/name-width 24)
      (sml/mode-width 'full)
      (rm-blacklist nil)
      :config
      (sml/setup)
      (add-to-list 'sml/replacer-regexp-list '("^~/.config/emacs/" ":Emacs:") t)
      (add-to-list 'sml/replacer-regexp-list '("^~/Workbench/" ":Code:") t)
      (add-to-list 'sml/replacer-regexp-list '("^~/Org/" ":Org:") t))

      (use-package minimal-theme)
      (load-theme theme t)

      (set-face-attribute 'fringe nil :background nil))
#+END_SRC


***** ~c4/typography~

This submodule defines typography settings for the UI. It allows you to set the fixed pitch (which
is also the default font) as well as the variable pitch (for Org and other document modes).

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

  (cl-defun c4/typography (&key code document)
    "A module for setting typography."
    (set-face-attribute 'default nil
      :font (format "%s-%s:slant=normal" (car code) (cadr code)))
    (set-face-attribute 'fixed-pitch nil
      :font (format "%s-%s" (car code) (cadr code)))
    (set-face-attribute 'variable-pitch nil
      :font (format "%s-%s" (car document) (cadr document))))

#+END_SRC


**** ~c4/ux~

The base UX module that sets some defaults to prevent Emacs from getting on your nerves before your
really start appreciating it. This includes:

+ inhibiting the startup message
+ beginning with a blank scratch
+ no error beeping
+ sensible autosaving
+ "y" or "n" prompting

  And the packages:

+ [[https://github.com/justbur/emacs-which-key][which-key]]: a necessity for discovering the default and custom keybindings throughout this configuration
+ [[https://github.com/Wilfred/helpful][helpful]]: provides a much more useful help interface
+ [[https://github.com/editorconfig/editorconfig-emacs][editorconfig]] plugin for Emacs: to keep style definitions where they belong
+ [[https://github.com/akermu/emacs-libvterm][vterm]]: a rich terminal so I don't have to leave Emacs for my sysadmin flow

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

(defun c4/ux ()
  "A module for the 'base' UX."
  (setq inhibit-startup-message t) ; inhibit startup message
  (setq initial-scratch-message "") ; no scratch message
  (setq visible-bell t)             ; enable visual bell
  (global-auto-revert-mode t) ; autosave buffer on file change
  (delete-selection-mode 1) ; Selected text will be overwritten on typing
  (fset 'yes-or-no-p 'y-or-n-p) ; convert "yes" or "no" confirms to "y" and "n"

  ;; See a database of all defined keybindings
  (use-package which-key
    :init
    (setq which-key-idle-delay 0.96)
    :config
    (which-key-mode))

  ;; Better help documentation
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

  ;; Editorconfig
  (use-package editorconfig
    :config
    (editorconfig-mode))

  ;; Better terminal
  (use-package vterm)

  (c4/lookup))

#+END_SRC

***** ~c4/lookup~

The UX base includes a single submodule for defining valuable search and sorting functionality using
the [[https://github.com/abo-abo/swiper][ivy ecosystem]] of packages. These include:

+ swiper: incremental buffer searching
+ ivy itself: better minibuffer completion
+ counsel: provides a richer experience in Emacs interactive prompts
+ [[https://github.com/Yevgnen/ivy-rich][ivy-rich]]: provides more contextual information in the minibuffer
+ [[https://github.com/raxod502/prescient.el][ivy-prescient]]: sorts your commands by usage

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

  (defun c4/lookup ()
    "A module for search and command functionality."
    ;; Minibuffer completion
    (use-package selectrum
      :config
      (selectrum-mode 1))

    ;; Intelligent command sorting with prescient
    (use-package selectrum-prescient
      :after selectrum
      :config
      (selectrum-prescient-mode 1)
      (prescient-persist-mode 1))


    ;; Incremental search
    (use-package ctrlf
      :config
      (ctrlf-mode 1))

    (use-package consult
      :init
      (defun find-fd (&optional dir initial)
        (interactive "P")
        (let ((consult-find-command "fd --color=never --full-path ARG OPTS"))
        (consult-find dir initial)))
     (advice-add #'register-preview :override #'consult-register-window)
     :custom
     (register-preview-delay 0)
     (register-preview-function #'consult-register-window)
     (consult-narrow-key "<"))

    (use-package marginalia
      :after consult
      :init
      (marginalia-mode)
      (advice-add #'marginalia-cycle :after
                  (lambda () (when (bound-and-true-p selectrum-mode)
                               (selectrum-exhibit))))
      (setq marginalia-annotators
       '(marginalia-annotators-heavy marginalia-annotators-light)))

    ;; Minibuffer actions
    (use-package embark)

    (use-package embark-consult
      :after (embark consult)
      :demand t
      :hook
      (embark-collect-mode . embark-consult-preview-minor-mode))

    ;; Partial search queries with orderless
    (use-package orderless
      :init
      (icomplete-mode)
      :custom
      (completion-styles '(orderless))))

  (provide 'base)
#+END_SRC

