C4.el
 "w" '(:ignore t :wk "window")
 "ww" '(other-window :wk "cycle windows")
 "wc" '(delete-window :wk "close")
 "wC" '(delete-other-windows :wk "fill frame")
 "wd" '(:ignore t :wk "desktop")
 "wdf" '(exwm-floating-toggle-floating :wk "floating")
 "wdF" '(exwm-layout-toggle-fullscreen :wk "fullscreen")
 "wdk" '(exwm-layout-toggle-keyboard :wk "keyboard mode")
 "wdm" '(exwm-layout-toggle-mode-line :wk "mode line")
 "wdM" '(exwm-layout-toggle-minibuffer :wk "minibuffer")
 "wn" '(:ignore t :wk "navigator")
 "wnn" '(C4/window-commander/body :wk "interactive")
 "wni" '(windmove-up :wk "jump up")
 "wnI" '(windmove-swap-states-up "swap up")
 "wnk" '(windmove-down :wk "jump down")
 "wnK" '(windmove-swap-states-down :wk "swap down")
 "wnj" '(windmove-left :wk "jump left")
 "wnJ" '(windmove-swap-states-left :wk "swap left")
 "wnl" '(windmove-right :wk "jump right")
 "wnL" '(windmove-swap-states-right :wk "swap right")
 "wnw" '(windmove-display-up :wk "open next window above")
 "wnW" '(windmove-delete-up :wk "close window above")
 "wns" '(windmove-display-down :wk "open next window below")
 "wnS" '(windmove-delete-down :wk "close window below")
 "wna" '(windmove-display-left :wk "open next window left")
 "wnA" '(windmove-delete-left :wk "close window to left")
 "wnd" '(windmove-display-right :wk "open next window right")
 "wnD" '(windmove-delete-right :wk "close window to right")
 "ws" '(:ignore t :wk "split")
 "wss" '(split-window-below :wk "horizontal")
 "wsS" '(split-window-right :wk "vertical"))

(defhydra C4/window-commander (:timeout 10)
  "Interactive window navigation"
  ("SPC" other-window "cycle")
  ("c" delete-window "close")
  ("C" delete-other-windows "fill frame")
  ("i" windmove-up "jump up")
  ("I" windmove-swap-states-up "swap up")
  ("k" windmove-down "jump down")
  ("K" windmove-swap-states-down "swap down")
  ("j" windmove-left "jump left")
  ("J" windmove-swap-states-left "swap left")
  ("l" windmove-right "jump right")
  ("L" windmove-swap-states-right "swap right")
  ("w" windmove-display-up "open next above")
  ("W" windmove-delete-up "close above")
  ("s" windmove-display-down "open next below")
  ("S" windmove-delete-down "close below")
  ("a" windmove-display-left "open next to left")
  ("A" windmove-delete-left "close left")
  ("d" windmove-display-right "open next to right")
  ("D" windmove-delete-right "close right")
  ("RET" nil "exit" :exit t))

(c4/user
  :name "Chatman R. Jr"
  :email "crjr.code@protonmail.com")

(c4/base
  :theme 'minimal-light
  :typography
  (c4/typography
    :code '("Input" 13)
    :document '("Lora" 16)))

(c4/projects
  :path "~/Workbench"
  :username "cr-jr")

(c4/code)

(c4/org :path "~/Org")

(c4/desktop)
