C4.org
** Projects

The =projects.el= module configures C4 for my Git/GitHub project workflows.

As with the others, to use it, you'll need to load it.

#+BEGIN_SRC emacs-lisp

(c4/projects
  :path "~/Workbench"
  :username "cr-jr")

#+END_SRC

It's pretty straightforward.

It installs projectile and points it to a =path= to look for projects under version control and then
evaluates the ~c4/git~ submodule with your GitHub =username=.

#+BEGIN_SRC emacs-lisp :tangle "./modules/projects.el"
(cl-defun c4/projects (&key path username)
  (use-package projectile
    :diminish
    :config
    (projectile-mode)
    :custom
    (projectile-project-search-path (list path))
    (projectile-completion-system 'ivy)
    (projectile-switch-project-action #'projectile-dired)
    :bind-keymap
    ("C-c p" . projectile-command-map))

  (use-package counsel-projectile
    :after projectile
    :config
    (counsel-projectile-mode))
  (eval (c4/git username)))

#+END_SRC

It has a single submodule for Git configuration you'll want to have a look at.

*** ~c4/git~

This submodule does the actual work of installing and configuring magit & forge. It also includes
[[https://github.com/dgutov/diff-hl][diff-hl]] so you can see changes to the files in your projects in the fringe.

This will make it easier to determine what changes to commit if you choose to stage hunks with magit
instead of whole files.

#+BEGIN_QUOTE
Be aware that you *will need* a GitHub account along with a personal access token to make any of this work.
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle "./modules/projects.el"

(defun c4/git (user)
  (use-package magit
    :commands (magit magit-status)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (use-package diff-hl
    :after magit
    :hook
    (after-init . global-diff-hl-mode)
    (magit-pre-refresh . diff-hl-magit-pre-refresh)
    (magit-post-refresh . diff-hl-magit-post-refresh))

  (use-package forge
    :after magit
    :custom
    (auth-sources '("~/.authinfo"))
    :config
    (ghub-request "GET" "/user" nil
      :forge 'github
      :host "api.github.com"
      :username user
      :auth 'forge)))

(provide 'projects)
#+END_SRC

** Code

The =code.el= module contains configuration and functionality for your programming needs.

The main module sets up packages for programming modes in general and a rich Emacs Lisp editing
experience besides.

You'll also want to include your desired language modules for your main programming projects.

#+BEGIN_SRC emacs-lisp

(c4/code)

#+END_SRC

*** Setup

This module works by including by setting the initial programming experience in a submodule and then
conditionally loading in rich language functionality.

#+BEGIN_SRC emacs-lisp :tangle "./modules/code.el"
  (defun c4/code ()
    (c4/code-init))

#+END_SRC


**** ~c4/code-init~

This submodule configures the base, essential packages for configuring the programming flow.

The big ones are:

+ [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]]
+ [[https://github.com/company-mode/company-mode][company-mode]]
+ [[https://github.com/flycheck/flycheck][flycheck]]
+ [[https://github.com/emacs-lsp/lsp-mode][lsp-mode]]
+ [[https://github.com/emacs-lsp/lsp-ui][lsp-ui]]

#+BEGIN_SRC emacs-lisp :tangle "./modules/code.el"

(defun c4/code-init ()
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

  (use-package company
    :hook (prog-mode . company-mode))

  (use-package company-box
    :hook (company-mode . company-box-mode))

  (use-package flycheck
    :hook (prog-mode . flycheck-mode))

  (use-package lsp-mode
    :hook (prog-mode . lsp-deferred)
    :commands (lsp lsp-deferred))

  (use-package lsp-ui
    :after lsp-mode
    :commands lsp-ui-mode)

  (use-package lsp-ivy
    :after lsp-mode
    :commands lsp-ivy-workspace-symbol))

(provide 'code)
#+END_SRC


*** Languages

** Documents

The =documents.el= module configures settings and functionality for document modes in Emacs. Its
primary focus is [[https://orgmode.org][Org Mode]] and configuring it for technical documentation, note-taking, journaling, and
literate programming.

Make sure you load it in:

#+BEGIN_SRC emacs-lisp

(c4/org :path "~/Org")

#+END_SRC

*** ~c4/org~

This is a top-level module exposed by =documents.el= It wraps all of the submodule Org Mode settings
under a common interface for =C4.el=.

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"
  (cl-defun c4/org (&key path)
    (use-package org
      :init
      (setq org-ellipsis " ↴")
      (setq org-directory path)
      (c4/org-agenda)
      (c4/org-templates)
      (c4/org-babel)
      :config
      (c4/org-theme)
      (advice-add 'org-refile :after 'org-save-all-org-buffers)
      :hook
      (org-mode . c4/org-init)))

#+END_SRC

**** ~c4/org-init~

A submodule that defines the absolute basic settings for Org Mode whenever an Org buffer opens.

By default I want automatically indent content under Org headings, enable variable pitch so I can
use my document font, and ensure my text will wrap at the right line length.

Packages in use:

+ [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]]: wraps visual line mode buffers at a given line length and provides the option
  to center the buffer

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-init ()
  (org-indent-mode 1)
  (variable-pitch-mode 1)
  (visual-line-mode 1)
  (auto-fill-mode 1)

  (use-package visual-fill-column
    :defer t
    :custom
    (visual-fill-column-width 108)
    (visual-fill-column-center-text t)
    :hook (org-mode . visual-fill-column-mode)))

#+END_SRC


**** ~c4/org-theme~

A submodule that performs some UI tweaks for Org buffers. Mainly, it resets certain faces to the
code font and makes the bullets look proper.

Packages in use:

+ [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]]: make your Org headings /fancy/

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-theme ()
  (set-face-attribute 'org-block nil
    :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-block-begin-line nil
    :foreground nil :weight 'normal :inherit 'fixed-pitch)
  (set-face-attribute 'org-document-info-keyword nil
    :foreground nil :weight 'normal :inherit 'fixed-pitch)
  (set-face-attribute 'org-drawer nil
    :foreground nil :weight 'normal :inherit 'fixed-pitch)
  (set-face-attribute 'org-property-value nil
    :foreground nil :weight 'normal :inherit 'fixed-pitch)
  (set-face-attribute 'org-block-end-line nil
    :foreground nil :weight 'normal :inherit 'fixed-pitch)
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))

  (use-package org-superstar
    :after org
    :hook
    (org-mode . org-superstar-mode)
    :custom
    (org-superstar-headline-bullets-list
      '("§" "☙" "჻" " " " " " " " "))))

#+END_SRC


**** ~c4/org-agenda~

This submodule sets up the Org agenda flow for creating task lists and project planning.

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-agenda ()
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  (setq org-agenda-files
    '("Tasks.org" "Projects.org"))

  (setq org-todo-keywords
    '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
        (sequence
          "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)"
          "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

  (setq org-refile-targets
    '(("Archive.org" :maxlevel . 1)
        ("Tasks.org" :maxlevel . 1)))

  (setq org-tag-alist
    '((:startgroup)
        ("@product" . ?P)
        ("@experiment" . ?E)
        ("@resource" . ?R)
        ("@learning" . ?L)
        ("@teaching" . ?T)
        (:endgroup)
        ("prototyping" . ?p)
        ("developing" . ?d)
        ("documenting" . ?D)
        ("testing" . ?t)
        ("refactoring" . ?r)))

  (setq org-agenda-custom-commands
    '(("d" "Dashboard"
        ((agenda "" ((org-deadline-warning-days 7)))
          (todo "NEXT"
            ((org-agenda-overriding-header "Next Tasks")))))

        ("P" "Products" tags-todo "@product")
        ("E" "Experiments" tags-todo "@experiment")
        ("R" "Resources" tags-todo "@resource")
        ("L" "Learning" tags-todo "@learning")
        ("T" "Teaching" tags-todo "@teaching")

        ("s" "Workflow Status"
          ((todo "WAIT"
            ((org-agenda-overriding-header "Waiting on External")
              (org-agenda-files org-agenda-files)))
          (todo "REVIEW"
            ((org-agenda-overriding-header "Under Review")
              (org-agenda-files org-agenda-files)))
          (todo "PLAN"
            ((org-agenda-overriding-header "Planning")
              (org-agenda-files org-agenda-files)))
          (todo "BACKLOG"
            ((org-agenda-overriding-header "Project Backlog")
              (org-agenda-files org-agenda-files)))
          (todo "READY"
            ((org-agenda-overriding-header "Ready for Work")
              (org-agenda-files org-agenda-files)))
          (todo "ACTIVE"
            ((org-agenda-overriding-header "Active Projects")
              (org-agenda-files org-agenda-files)))
          (todo "COMPLETED"
            ((org-agenda-overriding-header "Completed Projects")
              (org-agenda-files org-agenda-files)))
          (todo "CANC"
            ((org-agenda-overriding-header "Cancelled Projects")
              (org-agenda-files org-agenda-files))))))))

#+END_SRC


**** ~c4/org-templates~

This submodule sets up Org capture templates for scaffolding a new task and other TBD templating
needs.

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-templates ()
  (setq org-capture-templates
    `(("t" "Tasks / Projects")
        ("tt" "Task" entry (file+olp "Tasks.org" "Inbox")
          "* TODO %?\n %U\n %a\n %i" :empty-lines 1))))

#+END_SRC


