C4.org
**** ~c4/org-babel~

This submodule configures source block tangling and execution. It also defines the languages to
allow for a literate programming workflow.

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-babel ()
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (js . t)))

  (setq org-src-fontify-natively t)
  (setq org-confirm-babel-evaluate nil))


(provide 'documents)
#+END_SRC

** Desktop

As I stated earlier, Emacs is the driver of my desktop computing experience.

Therefore, the final piece in my Emacs configuration is EXWM. Using Emacs as my window manager
brings several advantages:

+ A unified desktop interface
+ Less context switching
+ A window manager as flexible and extensible as Emacs itself
+ Enforced focus on my work environment

I'm aware this approach isn't for everyone, and I wouldn't use it myself if I didn't trust the
stability of Emacs as software. If you have trepidations, you can disable the entire desktop module
and everything else will still work.

#+BEGIN_QUOTE
EXWM only works on Linux systems, though.
#+END_QUOTE

*** Setup

To actually use Emacs as my desktop environment, I need to create a =.xinitrc=.

#+BEGIN_SRC sh :tangle "~/.xinitrc"
# Caps to CTRL
setxkbmap -option ctrl:nocaps

# Disable touchpad
xinput set-prop 12 "Device Enabled" 0

# Default cursor
xsetroot -cursor_name left_ptr

# Xresources
xrdb ~/.Xresources

# Settings
gnome-settings-daemon &

# Autostart programs
dex -a

# Removable media
udiskie &

# Notifications
dunst &

# Start EXWM
exec dbus-launch --exit-with-session emacs -mm --debug-init
#+END_SRC

I also use software (ARandR) to configure my multi-monitor setup.

#+BEGIN_SRC sh :tangle "./desktop/multihead.sh" :tangle-mode (identity #o755)
#!/bin/sh
xrandr --output LVDS --primary --mode 1366x768 --pos 241x1080 --rotate normal --output VGA-0 --off --output HDMI-0 --mode 1920x1080 --pos 0x0 --rotate normal
#+END_SRC

Finally, I need to load in the main desktop package.

#+BEGIN_SRC emacs-lisp

(c4/desktop)
#+END_SRC


*** Configuration

This is the top level module that =desktop.el= exposes. It wraps all the desktop definition
submodules that are documented below.

#+BEGIN_SRC emacs-lisp :tangle "./modules/desktop.el"
    (defun c4/desktop ()
      "A module for my EXWM configuration."
      (use-package exwm
        :if window-system
        :config
        ;; Startup process
        (start-process-shell-command
          "nitrogen" nil "nitrogen --restore")

        (display-time-mode t)

        (setq exwm-workspace-number 6)
        (setq display-time-default-load-average nil)
        (setq exwm-workspace-warp-cursor t)
        (setq focus-follows-mouse t)

        (setq exwm-input-prefix-keys
              '(?\C-x
                ?\C-u
                ?\C-h
                ?\C-\
                ?\M-x
                ?\M-`
                ?\M-&
                ?\M-:
                ?\s-\ ))

        (setq exwm-input-global-keys
              `(([?\s-I] . windmove-swap-states-up)
                ([?\s-i] . windmove-up)
                ([?\s-L] . windmove-swap-states-right)
                ([?\s-l] . windmove-right)
                ([?\s-K] . windmove-swap-states-down)
                ([?\s-K] . windmove-down)
                ([?\s-J] . windmove-swap-states-left)
                ([?\s-j] . windmove-left)
                ([?\s-r] . exwm-reset)
                ([?\s-Q] . kill-emacs)
                ([?\s-q] . exwm-restart)
                ([?\s-W] . exwm-workspace-swap)
                ([?\s-w] . exwm-workspace-switch)
                ([?\s-D] . counsel-linux-app)
                ([?\s-d] . (lambda (cmd)
                              (interactive (list (read-shell-command "$ ")))
                              (start-process-shell-command cmd nil cmd)))
                ,@(mapcar (lambda (i)
                            `(,(kbd (format "s-%d" i)) .
                              (lambda ()
                                (interactive)
                                (exwm-workspace-switch-create ,i))))
                          (number-sequence 0 9))))

        (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

        ;; Update window class with the buffer name
        (add-hook 'exwm-update-class-hook #'c4/exwm-update-class)

        (require 'exwm-randr)
        (setq exwm-randr-workspace-monitor-plist
              '(0 "LVDS" 2 "LVDS" 4 "LVDS" 1 "HDMI-0" 3 "HDMI-0" 5 "HDMI-0"))
        (start-process-shell-command "xrandr" nil
                                      (concat user-emacs-directory "desktop/multihead.sh"))
        (exwm-randr-enable)

        (require 'exwm-systemtray)
        (setq exwm-systemtray-height 16)
        (exwm-systemtray-enable)

        (exwm-enable))

      ;; EXWM: Desktop Environment
      (use-package desktop-environment
        :after exwm
        :diminish
        :bind
        ("s-l" . windmove-right)
        :config
        (desktop-environment-mode)))

    (defun c4/exwm-update-class ()
      (exwm-workspace-rename-buffer exwm-class-name))

  (provide 'desktop)
#+END_SRC
