modules/documents.el

(defun c4/org-babel ()
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (js . t)))

  (setq org-src-fontify-natively t)
  (setq org-confirm-babel-evaluate nil))


(provide 'documents)
